==PAGE:1==
Automation of SOC analysis using SOAR
Master Thesis
DTU Compute
Department of Applied Mathematics and Computer Science
==PAGE:2==
Automation of SOC analysis using SOAR
Master Thesis
June, 2023
By
Alexander Welsch Carlsen
Copyright:
Reproduction of this publication in whole or in part must include the cus­
tomary bibliographic citation, including author attribution, report title, etc.
Cover photo:
Vibeke Hempler, 2012
Published by:
DTU, Department of Applied Mathematics and Computer Science,
Richard Petersens Plads, Building 324, 2800 Kgs. Lyngby Denmark
www.compute.dtu.dk
==PAGE:3==
Abstract
This project investigates the effectiveness of employing Security Orchestration, Automa­
tion, and Response (SOAR) within a Security Operations Center (SOC) to minimize anal­
ysis time. Four alert types are selected, and carefully crafted playbooks are developed
for them. These playbooks are deployed, and data on time use is collected. The results
showcase a significant reduction in analysis time with the developed playbooks. However,
the results also highlight the criticality of thoughtful playbook design and development to
fully leverage the potential of SOAR. This is shown by also collecting data on other alert
types with playbooks developed outside of the project. The other set of results show neg­
ligible time savings, and in some cases increased analysis times. Overall, this project
provides insights into the benefits, challenges, and future directions of integrating SOAR
into SOC operations.
ii
Automation of SOC analysis using SOAR
==PAGE:4==
Contents
Abstract . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
ii
1
Introduction
1
1.1
Contributions . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
2
1.2
Structure of paper
. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
2
2
Background & Related Works
3
2.1
Detection tools . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
3
2.2
SOAR . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
4
2.3
Previous Works . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
5
3
Identifying alerts
6
4
Design & Implementation
8
4.1
Suspicious office operations . . . . . . . . . . . . . . . . . . . . . . . . . . .
8
4.2
Daily cap reached
. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 10
4.3
Unusual sign­ins . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 10
4.4
Sign­in from one IP and failure from another . . . . . . . . . . . . . . . . . . 14
4.5
Challenges . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 15
5
Methodology
17
6
Results
18
6.1
Selected alerts . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 18
6.2
Other alerts . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 19
7
Discussion
21
8
Conclusion
22
Bibliography
23
Automation of SOC analysis using SOAR
iii
==PAGE:5==
iv
Automation of SOC analysis using SOAR
==PAGE:6==
1
Introduction
The increasing threat of cybercrime affects all industries. Companies across the globe
have lost millions due to incidents related to cyber­attacks. According to the FBI’s Internet
Crime Complaint Center, the potential total losses in 2022 were more than $10.2 billion[1].
This threat leads to companies seeking ways to protect themselves. Many options are
available and vary based on the budget and threat model.
For companies of a certain scale, the solution is to establish a Security Operations Center
(SOC), to handle detecting and responding to security incidents. Establishing such a
SOC can be difficult and expensive due to the resources and skills needed to man such
an operation. Arctic Wolf estimates that it costs over one million dollars a year just to
staff a SOC 24­7, and in addition to that comes costs associated with hardware, software
and training[2]. For this reason, many companies hire an external company to handle
this. These companies are referred to as Managed Security Service Providers (MSSPs)
and their service of a 24/7 manned SOC is often referred to as Managed Detection and
Response (MDR).
SOCs deal with massive amounts of data, collected from the devices in the organization.
For MSSPs, this amount of data is further multiplied by the number of customers they
manage. For the employees in the SOC to know what they need to react to, various tools
are used. The most notable of these tools is Security information and event management
(SIEM), which are systems that collect logs from different sources and generate alerts
based on predefined rules. These alerts will then indicate when there is something the
SOC analysts need to look into.
A common problem when dealing with SIEM systems is that most alerts generated are
false positives. From a security standpoint, false positives are not a problem, however,
they can create problems in other ways. SOCs are not cheap to run, and manpower is
limited, so preventing false positives, can give the analysts more time to identify actual
security problems. Additionally, there is the threat of alert fatigue, which can happen when
analysts have to handle too many false positives. This can lead to longer analysis times,
worse performance, and potentially missing actual security threats.
One possible solution to these problems is the use of Security Orchestration, Automation
and Response (SOAR) systems. The purpose of these systems is to automate as much as
possible, both regarding the analysis work, but also the response. The term was coined by
Gartner in 2017[3]. Automating analysis could be things like enriching the data by looking
up IOCs in threat intelligence, or compiling data on previous activity from involved users.
The automated response could be isolating machines, blocking IPs or requiring a user
to reset their password. Using automation would in theory allow the analysts to spend
their time on the cases that need in­depth analysis. It could also mean that the general
workload of the SOC would be significantly reduced saving the companies money and
requiring fewer people.
Since SOAR is a fairly new concept, it also means that not much real data is available on
how effective it is in the workflow of a SOC. This paper aims to investigate the effective­
ness of implementing a SOAR solution in the SOC at an MSSP, with main focus being on
how much time can be saved on analysis.
Automation of SOC analysis using SOAR
1
==PAGE:7==
Deploying a SOAR system takes more work than developing playbooks. This work in­
cludes setting up integration between the SOAR system and the various products, map­
ping entities, and overall configuration of the SOAR system. In addition, existing SIEM
rules may need to be changed, to fit with the entity mapping of the SOAR system. All of
this will be considered outside the scope of this project.
1.1
Contributions
The contributions of this project are as follows: Firstly, it provides a investigation into the
effectiveness of deploying SOAR within a SOC. Through analysis of time use, this project
demonstrates a significant reduction in analysis time achieved by implementing carefully
crafted playbooks developed specifically for this project. Secondly, it emphasizes the
importance of thoughtful playbook design and development to achieve the full potential of
SOAR, as evidenced by the varying results obtained from different playbooks. Together,
these contributions shed light on the benefits, challenges, and opportunities associated
with integrating SOAR into SOC workflows.
1.2
Structure of paper
The rest of the paper will be structured as follows: Section 2 will cover background knowl­
edge and previous work, section 3 will however which alert types were selected for the
project, section 4 describe the design and implementation of the playbooks for the project.
The methodology for collecting data will be described in 5, and these results will be pre­
sented in section 6. Section 7 will contain a discussion of the results and finally section 8
will conclude the paper.
2
Automation of SOC analysis using SOAR
==PAGE:8==
2
Background & Related Works
This section will cover some concepts that are essential background knowledge, followed
by some previous works that are related to this project.
2.1
Detection tools
Securing a company’s digital infrastructure can be done using a wide range of different
tools. These products have different aims and are thus used for securing different parts
of the infrastructure. This could be the networks, endpoints, or identities.
Central to these tools is the SIEM system. SIEMs are essentially systems that collect logs
from various sources, and monitor these logs based on set rules. The log sources can
be anything capable of logging, but in most cases cover logs from servers and firewalls.
A wide range of rules can then be set up to detect suspicious or malicious activities. This
could be based on actions like sign­in activity, account management, process executions
or network activity.[4]
SIEM has its limitations such as being limited to tools/devices that can send logs and hav­
ing no response actions, so there exist other tools. For securing endpoints are Endpoint
Detection and Response (EDR) tools. This can essentially be described as an extended
antivirus. It is supposed to run on all endpoints in an environment, and can then detect and
prevent activity directly on the endpoint. This could be detecting and stopping malware
or alerting on suspicious processes or connections.
On the network level, there are tools like Intrusion Detection Systems (IDS) or Intrusion
Prevention Systems (IPS). These systems monitor the network traffic for activity matching
defined rules. This could be detecting specific types of attacks, like DDoS attacks or a
worm spreading through the network. It can also look for unusual activity connections
to suspicious domains, or unusual internal connections. The capabilities will depend on
the specific product, some being focused on predefined rules, others being focused on
anomaly detection. An IDS purely monitors, and sends alerts, while an IPS takes it the
step further and can actively try to prevent attacks. This could be by actions like dropping
packets or blocking connections.[4]
Many vendors have started combining these various detection and response tools into
what is called extended detection and response (XDR). These are collections of various
security tools, like the previously mentioned tools, or many others. The capabilities of
XDR systems vary from vendor to vendor, so defining specifically what it is, can be hard.
2.1.1
Microsoft tools & KQL
Microsoft has tools covering most of these detection tools, most of them under the Mi­
crosoft Defender umbrella. Their XDR solution is Microsoft 365 Defender, which as an
example includes Defender for Endpoints, their EDR solution.
Their SIEM solution is called Azure Sentinel. This product runs in the Azure cloud, where
it can collect logs from all Microsoft products, and products from a wide range of other
vendors. It runs in a Log Analytics workspace, an Azure environment for managing and
querying logs. It uses the Kusto Query Language (KQL) for querying, a query language
similar to SQL. KQL queries are structured in a way that starts with the table that is queried,
followed by operators separated by pipes (|). As an example see the query below:
Automation of SOC analysis using SOAR
3
==PAGE:9==
SigninLogs
| where UserPrincipalName == "bob@contoso.com"
| summarize make_set(ResultType) by IPAddress
This query looks in the SigninLogs, it then shows only logs with the UPN ”bob@contoso.com”,
and finally it summarizes the results into a set of result types for each IP address. There
are many more operators for filtering, changing the data, or joining with other tables. This
language is also used for querying in Microsoft 365 Defender.
2.2
SOAR
There are many SOAR systems available. The previously mentioned Azure Sentinel does
have SOAR capabilities, however, the focus of this paper will be on Chronicle SOAR,
originally released under the name Siemplify.
The system consists of integrations into various products, cases created on alerts pulled
from the integrated products, and playbooks run on these alerts. Before it can be put into
use, a large amount of configuration is needed. This includes connecting all the necessary
products to the platform, mapping entities, and setting up the basic playbooks.
Each alert is created based on an alert in a connected security product. This alert will
then contain all the data pulled in, from the security product. When an alert is created, it
will either be attached to an existing case or a new case will be created.
Cases are a collection of one or more alerts and all details of the investigation related to
these events. It will contain any entities, insights, needed actions or anything else coming
from the alerts, or their associated playbooks. Additionally, it has a ”Case wall” which is
a log of everything that has happened on the case.
2.2.1
Playbook basics
The main benefits of the SOAR system are achieved through playbooks, as they are the
core of the automations.
In essence, a playbook can be seen as a flowchart. All of them start with a trigger, which
can be any predetermined parameter on an alert. This will then be followed by a series
of actions, blocks or flow decisions. Actions are single steps which can perform a variety
of operations. This can be simple operations like writing text or editing entities. They
can also be used to do more advanced things through the connected integrations. These
actions can include getting enrichment data on entities from public databases like Virus­
Total or AbuseIPDB or starting actions in EDR systems such as isolating a machine. All
actions consist of bits of Python code. If multiple actions are needed, there is the option of
using a block. Blocks are a series of actions, similar to playbooks, however, they can be
used inside of other playbooks. This means that a workflow can be put into a block, which
can then be used across multiple playbooks, similar to reusing a function in programming.
Lastly, there are flows, which are branches in the playbook where some kind of decision is
taken. These can be used when some actions only need to be taken if certain conditions
are met, or if the actions needed differ based on the circumstances. They can also be
made as a decision that needs to be made manually by an analyst.
2.2.2
Placeholders & Jinja2
To use all the data stored in cases, there needs to be a way to pull it out. This can be
achieved using Placeholders. In the text, the placeholder is created using brackets, with
the name of the data within. The name is structured in such a way that it starts with where
the data is located, followed by the name of the data. The location of the data could
be Alert, Case, Entity, Environment or Event. As an example, [Alert.Username] would
4
Automation of SOC analysis using SOAR
==PAGE:10==
get the data labelled ”Username” in the Alert. To get data from previous actions in the
playbook, the placeholder will need to use the name that the action is given.
If using placeholders is not enough, Jinja templates can be used. Jinja is a template
engine for Python, which gives the possibility of using Python expressions within the tem­
plates. In Chronicle SOAR this can be very useful, as using only placeholders is very
limited with regards to formatting. An integration for Jinja has been made for Chronicle
SOAR, so templates can be used through an action in a playbook. This action takes a
JSON of the arguments and a template, and after running it returns the filled template.
The action has the option of using JSON or HTML templates, and the HTML templates
can also be used for basic text templates.
2.3
Previous Works
The majority of promises of time­saving using SOAR come from vendors that produce
these products, however, in academia, there is a very limited amount of work done into
investigating these claims.
An article by Young[5] argues for the use of SOAR, by automating everything, which will
reduce alert fatigue by having the alert that is investigated manually, actually matter. He
outlines the reasons for using SOAR, but as a tool for the CISO in a company, and not
focused on companies with a SOC. Another similar work by Brewer[3] presents SOAR
systems as a solution to SOCs being short­skilled. He also argues that the streamlining
and automations of the tool will help cybersecurity professionals, put their skills better to
use. Both of these articles, however, only present SOAR in a theoretical way, and do not
provide any practical results as to how efficient they are at solving the problems they are
presented to be able to solve.
Another notable study by Norem et. al. [6] outlines a mathematical framework for eval­
uating SOAR tools. The study surveyed SOC operators by asking them which features
are most important to them, and then having them watch demonstration videos of various
SOAR tools, for which they are then also asked about. They then used the results of the
survey to narrow down the SOAR tools to be selected. The starting point of the study is
a lack of existing data, however, the focus is not on time savings but rather on features
available.
2.3.1
Machine Learning
As with any other field within computer science, machine learning is also being applied to
SOCs. One solution for SOcs is presented in a paper by Perera et. al.[7], in which they
present what they call a next­gen security operation center. Their presented solution aims
to use machine learning to handle the SOC work, so the analysts can focus on work that
matters. They use natural language processing (NLP) to process logs, and then predict
severity using ML. Furthermore, the system is trained on existing attack models Cyber
Kill Chain and the Mitre Attack framework. This work does not mention SOAR and can
be seen as an alternative solution to the same problem that SOAR aims to solve.
Automation of SOC analysis using SOAR
5
==PAGE:11==
3
Identifying alerts
Alerts have varying purposes, so different playbooks will be needed to give good results.
Some playbooks will apply to multiple alert types, however in general, to get the most
useful results, it can be seen as one playbook per alert type. To specify the scope of this
project, only certain alerts will be chosen to focus on.
To limit the scope of the project, only alerts investigated inside Azure Sentinel will be
considered. This will mean alerts from Azure Sentinel itself and alerts from Azure AD
Identity Protection. The Azure AD Identity Protection alerts are generated by another
Microsoft product, however, the investigation is done purely in Azure Sentinel due to the
logs all being available there.
Overall alerts will be grouped into two groups: ”Confirmation needed” and ”Analysis needed”.
This is to reflect the work needed workload to handle the alert. ”Confirmation needed” will
cover all alerts that mainly just need confirmation on whether the activity is expected. An
MSSP is not able to know every expected activity in a customer’s system, so the work­
flow for these alerts will consist of asking the customer if the activity was expected. An
example of this is a user was given administrator rights. ”Analysis needed” will be alerts
where a certain amount of analysis work will be needed, to determine what is going on.
This can be anything from determining if a URL is malicious, to finding out how a process
was started. The goal of dividing the alerts into these two groups is to cover both types
of alerts and to see in which category SOAR is most effective.
Finding the specific alert types is then done by looking at all alerts that have come in over
a six month period, and
The following alert types have been identified as being the scope of the project:
Confirmation needed
– Suspicious office operations
– Daily cap reached
Analysis needed
– Unusual sign­ins
– Sign­in from one IP and failure from another
The following table will give a brief explanation of what each of these alerts do:
6
Automation of SOC analysis using SOAR
==PAGE:12==
Alert Name
Description
Suspicious office oper­
ations
This alert triggers if certain Office operations are
performed, such as adding mailbox permissions
or creating a mail rule.
Daily cap reached
These rules detect if the daily cap for data inges­
tion in Azure Sentinel is close to being reached.
Going over the daily cap can be costly, and the
cause of the increase in logs may be due to ma­
licious activity or misconfiguration.
Unusual sign­ins
This covers four alert types from AzureAD Iden­
tity Protection, which triggers when login activity
for a user is considered unusual. This can be
due to factors like unfamiliar locations, anony­
mous IPs (VPN or Tor), or atypical travel. These
alerts could indicate a compromised account.
Sign­in from one IP and
failure from another
This rule triggers if a user has a successful login
from one IP a short time after a failure from an­
other IP. This may indicate a malicious attempt
at password guessing based on knowledge of
the user’s account.
Table 3.1: Descriptions of selected alert types
Automation of SOC analysis using SOAR
7
==PAGE:13==
4
Design & Implementation
The playbooks for this project will be created for each of the previously determined alert
types.
In each of the below sections, the design and implementation of each playbook will be
covered. Following that will be a section covering the challenges faced during the devel­
opment of the playbooks.
4.1
Suspicious office operations
The rule that this playbook is for, reacts to high­risk Office operations. These operations
could be of high severity if performed by an attacker, however, they are also often per­
formed during normal day­to­day operations. It is not possible to do much investigation
from an MSSP’s standpoint, as it will be the admins at the customer company, who knows
what is legitimate. For this reason, all the playbook needs to do, is write up a ticket ex­
plaining what is happening, which can then be sent to the admins for confirmation.
To best present this information, a template was created, as the structure for the tickets,
this can be seen below:
Rare and potentially high-risk Office operations
Case Number:
-----------------------------------
## Entities:
Time Generated:
Operation Name:
Source User Name:
Source Address
OfficeObjectID:
Parameters:
## Investigation/actions performed:
-----------------------------------
USERNAME performed XXX office operation.
For more details, see the parameters above.
## Conclusions/Recommendations:
-----------------------------------
Please confirm if this is expected.
In order for the playbook to follow this template, the Entities and Investigation sections
were transformed into Jinja templates. Entities:
TimeGenerated: {{ input_json["TimeGenerated"] }}
Name: {{ input_json["Name"] }}
Source User Name: {{ input_json["SourceUserName"] }}
Source Address: {{ input_json["SourceAddress"] }}
OfficeObjectID: {{ input_json["OfficeObjectId"] }}
Parameters: {{ input_json["Parameters"] }}
{{ "\n" }}
The investigation part of the template is done using if­else in Jinja. This matches the
name of the operation, and writes a relevant text for it. The text is based on the Microsoft
documentation of the PowerShell cmdlet corresponding to the Name1
1https://learn.microsoft.com/en-us/powershell/module/exchange/
8
Automation of SOC analysis using SOAR
==PAGE:14==
{% if input_json["Name"] == "Add-MailboxPermission" %}
"{{input_json["SourceUserName"] }}" added a mailbox permisson
for "{{ input_json["OfficeObjectId"]}}".
{% elif input_json["Name"] == "Add-MailboxFolderPermission" %}
"{{input_json["SourceUserName"] }}" added a mailbox permisson for
the folder "{{ input_json["OfficeObjectId"]}}".
{% elif input_json["Name"] == "Set-Mailbox" %}
"{{input_json["SourceUserName"] }}" modified the properties of
the mailbox "{{ input_json["OfficeObjectId"]}}".
{% elif input_json["Name"] == "New-ManagementRoleAssignment" %}
"{{input_json["SourceUserName"] }}" created a new
Management Role Assignment "{{ input_json["OfficeObjectId"]}}".
{% elif input_json["Name"] == "New-InboxRule" %}
"{{input_json["SourceUserName"] }}" created the new Inbox rule "{{ input_json["OfficeObjectId"]}}".
{% elif input_json["Name"] == "Set-InboxRule" %}
"{{input_json["SourceUserName"] }}" modified the Inbox Rule "{{ input_json["OfficeObjectId"]}}".
{% elif input_json["Name"] == "Set-TransportRule" %}
"{{input_json["SourceUserName"] }}" modified the Transport Rule"{{ input_json["OfficeObjectId"]}}".
{% else %}
"{{input_json["SourceUserName"] }}" performed a {{input_json["Name"] }} operation
on "{{ input_json["OfficeObjectId"]}}".
{%+ endif %}
The data to fill these templates is pulled from Azure Sentinel using a KQL query. This
query is based on the query for the Microsoft SIEM rule2, but with some modifications, so
it only contains the fields that are needed, and the Parameters are formatted in a readable
way.
OfficeActivity
| where TimeGenerated > ago(1d)
| where Operation in~ ("Add-MailboxPermission", "Add-MailboxFolderPermission", "Set-Mailbox",
"New-ManagementRoleAssignment", "New-InboxRule", "Set-InboxRule", "Set-TransportRule")
| where not(UserId has_any ('NT AUTHORITY\\SYSTEM (Microsoft.Exchange.ServiceHost)',
'NT AUTHORITY\\SYSTEM (w3wp)', 'devilfish-applicationaccount')
and Operation in~ ("Add-MailboxPermission", "Set-Mailbox"))
| where UserId !contains "SpoolsProvisioning-ApplicationAccount"
| extend ClientIPOnly = tostring(extract_all(
@'\[?(::ffff:)?(?P<IPAddress>(\d+\.\d+\.\d+\.\d+)|[^\]]+)\]?',
dynamic(["IPAddress"]), ClientIP)[0][0])
| extend
StartTime = TimeGenerated, SourceUserName = UserId,
SourceAddress = ClientIPOnly, Deployment = OfficeWorkload,
CategoryOutcome = ResultStatus, Name = Operation
| project TimeGenerated, Name, SourceUserName, SourceAddress, OfficeObjectId, Parameters
| extend Parameters =
replace_string(
replace_string(
replace_string(
replace_string(tostring(Parameters), "\"}]", ""),
"\"},{\"Name\":\"", "\n - "),
"\",\"Value\":\"", ": "),
"[{\"Name\":\"", "\n - ")
With the Jinja templates and the KQL query created, it was then combined into the play­
book. When the resulting playbook is triggered on an alert, it then runs through it like a
flow chart. First, it checks if the case description is empty. This is done in case it is a new
alert being added to an existing case. If it is empty, the KQL is run in Azure Sentinel, the
results are forwarded to the Jinja templates which format it, and finally, it is combined into
the ticket which is saved as the case description. A picture of the playbook can be seen
in figure 4.1.
The idea is that this final case description should be enough for the analyst to send to
the admins for confirmation, with minimal manual analysis work needed. The last two
2https://github.com/Azure/Azure-Sentinel/tree/master/Solutions/Microsoft365/AnalyticRules/
RareOfficeOperations.yaml
Automation of SOC analysis using SOAR
9
==PAGE:15==
Figure 4.1: Suspicious office operations playbook. Unfortunately due to limitations in
Chronicle SOAR, it was not possible to take a better resolution picture. Chronicle SOAR
automatically adds an empty field after the last action/block in a playbook, so the line to
the right of the last block does not lead to anything.
steps simply enrich the entities in the case with AbuseIPDB and VirusTotal. These do not
interact with the case description and are only there to add details to the case overview.
4.2
Daily cap reached
This playbook covers two alerts, when the daily cap reaches 80% and when it reaches
90%. They are combined since they are essentially handled the same way. The alerts
are used as a notification that something unusual is going on with the data usage, so no
analysis work is needed. This means that all the analyst needs to do is write up a ticket
to send to the admins.
Since no analysis is needed, SOAR can easily fully automate this. The developed play­
book works by checking which of the two alert types it is working on, and filling the pre­
made template using placeholders. The developed template can be seen below, this is
showing the 95% version, but the other version is almost the same:
[Alert.OriginalName]
Incident Number:
[Alert.incidentNumber]
-----------------------------------
## Entities:
Time: [Event.Siemplify_Start_Time]
Data: [Event.DataGB]
## Investigation/actions performed:
-----------------------------------
This is informational.
95% of the daily quota for the log analytics workspace is reached
when looking back over the last 24 hours.
## Conclusions/Recommendations:
-----------------------------------
No action needed.
This should result in a ticket ready to send to the admins. The resulting playbook can be
seen in figure 4.2.
4.3
Unusual sign­ins
This is the most advanced playbook developed for this project. It covers four different
types of alerts that can come from AzureAD Identity Protection, ”Unfamiliar Sign­in Prop­
erties”, ”Anonymous IP Address”, ”Anomalous Token”, and ”Atypical Travel”. Common for
all these alerts is that they alert on login events that AzureAD Identity Protection considers
unusual.
10
Automation of SOC analysis using SOAR
==PAGE:16==
Figure 4.2: Daily Cap Reached playbook. Same limitations as in figure 4.1 applies to this
screenshot.
4.3.1
Design
Overall, the idea of the playbook is to automatically determine the following details:
• Is the IP a VPN?
• Is the IP known to be malicious?
• Has the IP been used previously? (both for the user, and others in the system)
• Did the logins succeed, and if not, did it fail at MFA?
In relation to time, we consider the last 24 hours to be current to the alert and from one
day ago to 30 days ago to be past activity.
Based on those results, a decision tree is used to determine how the alert should be
handled, this can be seen in figure 4.3.
Figure 4.3: Decision tree for ”Unusual Sign­In” alerts
The first part of the tree branches based on if the IP is known to be malicious or a VPN.
If it is not, we look at whether or not the IP has been seen before. If it has been seen
before, we consider it benign activity, and if not, it needs to be confirmed if it is recognized
activity.
If the IP is known to be malicious or VPN, the decision depends on the login result. If the
login completely fails, no action is needed, as there is no indication of any compromise,
and it is not unexpected to see random login attempts to anything exposed to the internet.
If the login fails at MFA, it indicates that the password is likely compromised, so the pass­
word should be reset. Finally, if the login succeeds, it is considered a full compromise.
Automation of SOC analysis using SOAR
11
==PAGE:17==
This means that the password and MFA should be reset. To further decide what needs to
be done, analysis is needed into what the attacker used the account for (if anything), and
the importance of the account.
4.3.2
Implementation
To determine if an IP is a known VPN, two options were found, IP Quality Score3 and
Spur4. Of the two, Spur seemed to have the highest quality results, however, they do
not have an integration with Chronicle SOAR, which IP Quality Score does. Developing
a new integration for Spur was deemed beyond the scope of this project, so IP Quality
Score was used.
To determine if an IP is known to be malicious, integrations to AbuseIPDB, VirusTotal and
IP Quality Score were used.
Three KQL queries were developed for getting the needed data from Azure Sentinel. The
first query gets the details on the alert itself. Most importantly, this includes the User ID
and the IP address. In addition, it has some logic to handle the different alert types. This
is done by looking up the alert ID, which is included in the query using the Placeholder
[Event.properties_systemAlertId]. In all cases, it will return an I, and a UserId. In the
case of Atypical Travel alerts, the IP will be the current IP, and in addition, the Previous
IP and login time will be included. For Unfamiliar Sign­In Properties alerts, the detection
subcategory will also be included. The query can be seen here:
SecurityAlert
| summarize arg_max(TimeGenerated, *) by SystemAlertId
| where SystemAlertId in("[Event.properties_systemAlertId]")
| mv-expand todynamic(Entities)
| where Entities has "AadUserId"
| extend ExtendedProperties = parse_json(ExtendedProperties)
| extend
UserId = tostring(parse_json(Entities).["AadUserId"]),
ClientIP = ExtendedProperties.["Client IP Address"],
CurrentIP = ExtendedProperties.["Current IP Address"],
PreviousIP = ExtendedProperties.["Previous IP Address"],
DetectionSubcategory = ExtendedProperties.["Detection Subcategory"],
PreviousLoginTime = ExtendedProperties.["Previous Signin DateTime"]
| project
UserId,
IP = iff(isnotempty(CurrentIP), CurrentIP, ClientIP),
DetectionSubcategory, // Only on Unfamiliar Sign-In Properties
PreviousIP, // Only on Atypical Travel
PreviousLoginTime // Only on Atypical Travel
The second query gets the logs for the sign­ins related to the user and IP. It looks at
logs from the last day where the user and IP match. From these logs, it extracts relevant
data about authentication details and device. It then summarizes the results for a more
readable result. Finally, a new field is created SignInResult, which shows the overall
result of the login events. If any of the events were successful logins, it shows Success”,
otherwise if any of them were failures due to MFA it shows ”MFA Failure”. If neither of
those options was true, it shows ”Failure”. This extra field is used for the decision in the
playbook.
AzureAD logs the activity in two tables, SigninLogs and AADNonInteractiveUserSignInLogs.
While most relevant activity will happen in SigninLogs, both tables need to be queried to
give the full picture. With inspiration from Microsoft’s own Sentinel rules, this is achieved
by creating the query as a KQL function, which is run on both tables, and these results
3https://www.ipqualityscore.com/
4https://spur.us/
12
Automation of SOC analysis using SOAR
==PAGE:18==
are combined with a union5.
The official documentation from Microsoft regarding AzureAD login codes does not con­
tain a list of codes which are related to Successful logins or MFA failures, so lists of these
codes were created manually. To identify the codes for the lists, the most common result
codes were found by querying a live system, these were then looked up in the documen­
tation, and the ones that relate to successes or MFA were added to the corresponding
lists. While result codes other than 0 are normally considered a failure, certain codes in
AzureAD refer to errors that happen after a successful login. An example of this is 50140.
This code happens when an error occurs during the ”Keep me signed in” prompt, which
is shown to the user after they have successfully authenticated.
The final query can be seen here:
let FailureCodesMFA = dynamic([50074, 50076, 500121, 50088, 50079]);
let SuccessCodes = dynamic([0, 50140, 50125, 70043, 70044]);
let aadFunc = (tableName: string) {
table(tableName)
| where TimeGenerated > ago(1d)
| where UserId == "[Get Alert Info.JsonResult| "UserId"]"
| where IPAddress == "[Get Alert Info.JsonResult| "IP"]"
| project TimeGenerated, ResultType, ResultDescription,
Identity, AppDisplayName,
AuthenticationDetails = parse_json(AuthenticationDetails),
AuthenticationRequirement, ConditionalAccessStatus,
todynamic(DeviceDetail), IPAddress,
NetworkLocationDetails, UserAgent, UserPrincipalName, Type
| extend
DeviceName = tostring(DeviceDetail.["displayName"]),
DeviceTrustType = tostring(DeviceDetail.["trustType"]),
FirstFactorStatus = tostring(AuthenticationDetails[0].authenticationStepResultDetail),
SecondFactorStatus = tostring(AuthenticationDetails[1].authenticationStepResultDetail)
| summarize
StartTime = min(TimeGenerated),
EndTime = max(TimeGenerated),
ResultTypes = make_set(ResultType),
ResultDescriptions = make_set(ResultDescription),
AppDisplayNames = make_set(AppDisplayName),
UserAgents = make_set(UserAgent)
by
UserPrincipalName, Identity, IPAddress,
DeviceName, DeviceTrustType, Type
| extend SignInResult = iff(ResultTypes has_any (SuccessCodes), "Success",
iff(ResultTypes has_any (FailureCodesMFA), "MFA Failure", "Failure"))
};
let aadSignin = aadFunc("SigninLogs");
let aadNonInt = aadFunc("AADNonInteractiveUserSignInLogs");
union isfuzzy=true aadSignin, aadNonInt
The last query is similar to the previous one but simpler. It looks at all logs between a day
ago and 30 days ago and finds all successful logins. The results are then summarized
to a list of users and a count of these. This query uses the same list of successful result
codes, and method of querying both relevant tables, as in the previous query.
let SuccessCodes = dynamic([0, 50140, 50125, 70043, 70044]);
let aadFunc = (tableName: string) {
table(tableName)
| where TimeGenerated < ago(1d) and TimeGenerated > ago(30d)
| where IPAddress == "[Get Alert Info.JsonResult| "IP"]"
| where ResultType in (SuccessCodes)
| summarize
UserList = make_set(UserPrincipalName),
UserCount = dcount(UserPrincipalName),
make_set(Type)
5Multiple rules use this, one example is seen here:
https://github.com/Azure/Azure-Sentinel/blob/
master/Solutions/AzureActiveDirectory/AnalyticRules/SigninBruteForce-AzurePortal.yaml
Automation of SOC analysis using SOAR
13
==PAGE:19==
by IPAddress
};
let aadSignin = aadFunc("SigninLogs");
let aadNonInt = aadFunc("AADNonInteractiveUserSignInLogs");
union isfuzzy=true aadSignin, aadNonInt
The playbook is then set up in the following order:
1. Get alert data using query 1
2. Lookup IP address on AbuseIPDB, VirusTotal and IP Quality Score
3. Get login data using query 2 and 3
4. Decide recommendation using decision tree
5. Format entities and analysis using Jinja templates
6. Update the case description with the Jinja template results.
The final playbook can be seen in figure 4.4
Figure 4.4: Unusual Login playbook. Some actions are marked in red, It is cropped in
two, to better show it, but same limitations as in figure 4.1 applies to this screenshot.
4.4
Sign­in from one IP and failure from another
This rule always needs manual analysis, however usually not too much. This means that
the majority of the time spend on these alerts, is due to ticket writing. Because of this, the
main focus of the playbook developed for this rule is to write the ticket.
In this case, all the data needed to write the ticket is already included in the alert data. This
means that the template can be filled without any prior actions needed. The developed
template has the following format:
[Alert.OriginalName]
Incident Number:
[Alert.incidentNumber]
14
Automation of SOC analysis using SOAR
==PAGE:20==
-----------------------------------
## Entities:
Username: [Event.userPrincipalName]
Application: [Event.AppDisplayName]
Timestamp (Failed): [Event.FailedLogonTime]
IP Address (Failed): [Event.FailedIPAddress]
Result Type: [Event.ResultType] ([Event.ResultDescription])
Timestamp (Successful): [Event.SuccessLogonTime]
IP Address (Successful): [Event.SuccessIPAddress]
## Investigation/actions performed:
-----------------------------------
The user "[Event.userPrincipalName]" was seen failing to login from "[Event.FailedIPAddress]",
while succeeding to login from "[Event.SuccessIPAddress]".
## Conclusions/Recommendations:
-----------------------------------
The recommendation will be up to the analyst, as they will always need to look into the
actual logs to determine what is going on.
The remaining actions in the playbook are enrichment actions, not for the ticket, but for
the case/alert view in the SOAR interface. These include looking up logins for the user
and enriching IP with AbuseIPDB.
Figure 4.5: ”Sign­in from one IP and failure from another” playbook. The same limitations
as in figure 4.1 applies to this screenshot.
4.5
Challenges
Many difficulties were experienced during the development of the playbooks. These af­
fected all parts of the development process.
To start with, there is a severe lack of documentation of the Chronicle SOAR platform.
Chronicle has some online courses, and a documentation portal, however, most of this
documentation is focused on the user and configuration of the platform, with most of
the features related to Playbooks being sparely documented. For the features where
documentation exists, it is mainly focused on examples, meaning that it is only useful if
you want to do exactly what the example shows. This unfortunately meant a lot of trial
and error, before getting things to work.
During the playbook development, there were also issues getting Chronicle SOAR to do
what you want it to do. Actions on playbooks seem to be intended to be used in an ”all or
nothing” fashion. This means that if an alert contains multiple IP addresses, you have to
perform the actions on all of them, there is no easy way to do actions on single entities.
With a programming background, performing actions on each entity would seem like a
straight forwards choice, however, this is not possible, as playbooks have no methods of
performing loops.
Another challenge was testing playbooks. There was a lack of test data, making it hard
Automation of SOC analysis using SOAR
15
==PAGE:21==
to verify that each part of the playbooks functioned as intended. Since playbooks are
made to interact with live systems, they must be tested before being put into production.
This is however hard without much test data to do it on. The situation regarding missing
documentation also made the lack of test data even worse.
Finally, multiple bugs were experienced in the Chronicle SOAR platform. At one point, an
update was deployed which caused placeholders to be written directly, instead of being
evaluated as intended. This broke many things in playbooks, for example, queries sud­
denly had [Placeholder] inside the query, meaning that the query would fail. Another
bug experienced was during the development of the Unusual sign­ins playbook, where
suddenly the actions were being run as manual actions instead of automatic, despite
them being configured to run automatically. This meant that you would have to click exe­
cute on every single action in the playbook for it to run, which negates the whole purpose
of having a playbook.
16
Automation of SOC analysis using SOAR
==PAGE:22==
5
Methodology
This paper aims to compare the time used for manual analysis and SOAR­assisted anal­
ysis. To gather data on this, several metrics will be collected on multiple analysed alerts.
The same process will be performed on alerts manually analysed, and on SOAR­assisted
alerts.
All data will be collected in the SOC/MDR of a Danish MSSP. While this MSSP has multiple
customers, it will not be taken into consideration which customer the individual alerts
correspond to. This is done since the goal is to measure the work as a whole, and for
that, the number and distinction of customers are not relevant.
One set of results will be collected on alerts handled manually (i.e. without SOAR). This
will mean based on the workflow used in the SOC before implementing a SOAR system.
Overall this consists of opening an alert, reading what it is regarding, analysing in the
relevant products and running queries, and finally writing up a ticket with a conclusion.
The other set of results will be collected on alerts which are assisted by SOAR. This means
that the analysis will be assisted by the playbooks developed in the previous section.
While the playbook aims to reduce the manual analysis as much as possible, sometimes
manual analysis will still be needed. For these alerts, the workflow will consist of reading
the results from the playbook, reading any other insights from other playbooks, doing
some manual analysis if needed, and finally finishing the ticket written by the playbook.
Due to limitations of the amount of data corresponding to the developed playbooks, a
separate set of data will be collected on some other alert types. These will cover alerts
which had a playbook developed outside of this project. Since these playbooks were not
developed in this project, the design of them will not be detailed. For the same reason,
this data will be kept separate from the previously mentioned data. The collection method
will be the same.
It is possible to collect data on analysis with and without SOAR, by getting data from
before and after the deployment of the playbook. In addition, some customers are not
on­boarded in the SOAR platform, so some data without SOAR will also be possible to
collect after the deployment of playbooks.
The following metrics will be recorded, to measure efficiency:
• Time to start ­ Time taken from alert is generated, until analysis starts
• Analysis time ­ Time spend on the analysis
• Total time ­ Time taken from alert is generated, until the analysis is completed
These measures will be collected by pulling the alert generation time, analysis start time,
and analysis end time. In addition, the alert title and ID will be collected.
Since the alerts are taken from a SOC working in real­time, the amount of incoming alerts,
and how they are spread out between the categories will vary. While it is possible to collect
more data, by simply waiting for more alerts to come in, it will not be possible to control
what kinds of alerts will be handled. For this reason, there will likely be a significant
difference in the number of alerts analysed for each category.
Automation of SOC analysis using SOAR
17
==PAGE:23==
6
Results
The results were collected over a period from March 20th to June 1st, meaning a total of
two months and 12 days.
As mentioned in the previous section, the results are separated into two parts. Selected
alerts covers data for alerts which were selected in Section 3, while Other alerts covers
data for alerts which had a playbook deployed which was not developed in this project.
6.1
Selected alerts
The results for the selected can be seen in the following two tables. For alerts handled
manually, the results are in table 6.1, while the results assisted with SOAR can be seen in
table 6.2. Unfortunately, there were no alerts generated for ”Suspicious office operations”
after the playbook was deployed, which means there is no data in the SOAR­assisted
table for that alert type. Overall a total of 426 alerts were analysed manually, and 134
alerts with SOAR.
Alert Type
Count
Time to start
Analysis Time
Total Time
Mean
Std
Mean
Std
Mean
Std
Total
426
00:56:12
01:11:34
00:41:56
00:37:53
01:38:08
01:23:12
Suspicious office opera­
tions
5
00:06:54
00:08:47
00:33:18
00:03:20
00:40:12
00:10:12
Daily cap reached
0
– No Data –
Unusual sign­ins
66
00:47:09
01:23:04
00:35:43
00:26:15
01:22:53
01:28:31
Sign­in from one IP and
failure from another
355
00:58:35
01:09:28
00:43:12
00:39:49
01:41:48
01:22:15
Table 6.1: Results for manual analysis on alerts selected for this project
The results for manual analysis show an overall average analysis time of 41 minutes and
56 seconds, where unusual sign­in alerts take around 35 minutes and ”Sign­in from one
IP and failure from another” alerts take around 43 minutes. For reaction time, the total
average is almost an hour at 56 minutes and 12 seconds.
Alert Type
Count
Time to start
Analysis Time
Total Time
Mean
Std
Mean
Std
Mean
Std
Total
134
00:20:59
00:30:35
00:16:12
00:21:18
00:37:11
00:38:16
Suspicious office opera­
tions
0
– No Data –
Daily cap reached
73
00:09:04
00:13:54
00:05:51
00:10:21
00:14:56
00:18:15
Unusual sign­ins
16
00:26:17
00:34:08
00:27:46
00:14:27
00:54:03
00:36:02
Sign­in from one IP and
failure from another
45
00:38:24
00:39:28
00:28:52
00:27:07
01:07:16
00:39:52
Table 6.2: Results for SOAR­assisted analysis on alerts selected for this project
For the SOAR­assisted results, there is a decrease in time across the board. The average
analysis time is decreased by about 25 minutes. The average time to start is decreased
18
Automation of SOC analysis using SOAR
==PAGE:24==
by 36 minutes, and the average total time is decreased by over an hour. The standard
deviations have also decreased across the board, so the time to react and analyse has
become less varied from alert to alert. Unfortunately, the SOAR­assisted results are based
on a significantly lower amount of alerts.
6.2
Other alerts
The results for the other alerts can be seen in the following two tables. For alerts handled
manually, the results are in table 6.3, while the results assisted with SOAR can be seen in
table 6.4. Overall a total of 95 alerts were analysed manually, and 225 alerts with SOAR.
This only includes alerts that had a playbook deployed, and there were alerts both with
and without SOAR.
Alert Type
Count
Time to start
Analysis Time
Total Time
Mean
Std
Mean
Std
Mean
Std
Total
95
00:54:00
01:10:53
00:28:00
00:34:58
01:22:01
01:21:52
Rare Application Con­
sent
14
01:14:52
01:20:42
00:38:36
00:55:28
01:53:28
01:58:51
SharePoint File Opera­
tion from Unknown IP
6
01:15:51
01:25:51
00:31:04
00:15:37
01:46:55
01:20:34
Sign­Ins from IPs that
Attempt Sign­Ins to Dis­
abled Accounts
12
00:35:45
00:31:27
00:24:51
00:35:34
01:00:37
00:51:30
Brute Force Attack
17
00:21:59
00:21:53
00:36:40
00:46:17
00:58:39
01:00:31
Account with Don’t Ex­
pire Password
15
00:22:56
00:42:57
00:15:26
00:15:21
00:38:23
00:42:43
SchTask Created
3
03:41:03
02:04:12
00:30:24
00:22:30
04:11:27
01:45:37
User
Created
and
Added
to
Administra­
tors
12
00:51:06
00:56:54
00:17:39
00:18:24
01:08:45
00:53:00
User Added to Group
16
01:15:15
01:23:16
00:29:50
00:26:42
01:45:06
01:17:18
Table 6.3: Results for manual analysis on other alerts
The data on the manual analysis show a similar picture as with the previously selected
alerts. An average reaction time of 54 minutes and an average analysis time of 28 min­
utes. Looking across the different alerts, there are some alerts which have lower times,
and some that have higher. One outlier is ”SchTask Created” which has a reaction time
of 3 hours and 41 minutes, significantly higher than all other alerts observed.
Compared with the SOAR­assisted results, it shows an insignificant decrease in analysis
time of 10 seconds. The reduction in reaction time is slightly higher at 5 minutes, but still
not a significant reduction. Looking at the individual alerts, there is a varied picture, with
some alerts having reduced times. Three of the alert types had an increase in analysis
time when using SOAR.
Automation of SOC analysis using SOAR
19
==PAGE:25==
Alert Type
Count
Time to start
Analysis Time
Total Time
Mean
Std
Mean
Std
Mean
Std
Total
225
00:49:15
01:08:13
00:27:50
00:36:29
01:17:05
01:18:46
Rare Application Con­
sent
12
00:29:51
00:56:17
00:48:17
00:43:16
01:18:09
00:59:17
SharePoint File Opera­
tion from Unknown IP
5
02:12:36
01:22:18
00:53:42
01:09:24
03:06:19
01:15:47
Sign­Ins from IPs that
Attempt Sign­Ins to Dis­
abled Accounts
20
00:31:59
00:41:13
00:26:31
00:33:21
00:58:31
00:47:18
Brute Force Attack
66
00:46:41
00:59:37
00:32:37
00:34:49
01:19:19
01:16:52
Account with Don’t Ex­
pire Password
30
00:26:40
00:34:51
00:12:26
00:14:45
00:39:07
00:38:47
SchTask Created
12
01:04:01
00:56:41
00:28:37
00:31:09
01:32:38
00:55:23
User
Created
and
Added
to
Administra­
tors
7
00:30:47
00:28:14
00:17:30
00:14:31
00:48:17
00:33:04
User Added to Group
73
01:02:24
01:28:28
00:25:54
00:41:09
01:28:19
01:37:51
Table 6.4: Results for SOAR­assisted analysis on other alerts
20
Automation of SOC analysis using SOAR
==PAGE:26==
7
Discussion
The goal of this project was to show how much time can be saved in SOC analysis by
using SOAR. Looking at the alerts selected in this project, there is a clear decrease in
time spent across the board. The alerts were on average reacted to 36 minutes faster,
and analysed 25 minutes faster, meaning the total time was on average decreased by 1
hour. This is however without having a full picture of two of the alert types. At the same
time, the standard deviation is also significantly decreased, meaning that the time each
alert takes is more consistent. The decrease in reaction time is likely directly correlated
to lower analysis time, as it means that analysts can move on to the next alert faster.
Most of the time savings likely come from the ticket being mostly written, so all the analyst
has to do, is verify the details. Additionally, a fair amount of time the analyst would nor­
mally spend querying is taken out because the playbook has already done it. The higher
variation in manual analysis times is likely due to analysts not all working the same way,
meaning some analysts will be slower than others. When SOAR takes over that analysis,
it will always take the same time to run.
Looking at the results for other alerts, a very different picture is shown. Here the time
savings are negligible, and for some alert types, they took longer to analyse with SOAR.
Since the playbooks were not developed as part of this project, they were likely made with
a different design goal. They may have been developed quickly, potentially with bugs in
them, just to have something in place. It could also be that some of these alerts are simply
not suitable for analysing with a playbook in their current state. They may need changes
in the rule itself. This could lead to SOAR making analysis harder and slower for analysts
since they have an extra layer to go through before they get to their ”usual” analysis.
Overall the results from these other alerts should be taken with a grain of salt, as their
playbooks are not necessarily comparable in the same way as the playbooks developed
during this project are.
Using the total averages from the selected alerts, a SOC analyst working an 8­hour day
would be able to handle around 11 alerts in a day without SOAR, but 30 alerts assisted by
SOAR. This could lead to a significant reduction in the needed workforce in a SOC. If as
mentioned earlier, a SOC analyst costs $90.000 a year[2], so 25 minutes saved could mean
saving $18 per alert1. This of course varies based on the local employment situations. For
small SOCs that are not 24/7, these time savings could mean more time for other tasks
not necessarily related to alerts. Individual SOCs would need to evaluate the cost savings
themselves based on the cost of implementing a SOAR system versus their current costs
of running the SOC.
1Assuming 40­hour work week and 52 weeks in a year.
Automation of SOC analysis using SOAR
21
==PAGE:27==
8
Conclusion
This project has delved into the effectiveness of employing SOAR to minimize analysis
time within a Security Operations Center (SOC). The findings of this study present com­
pelling evidence of a significant reduction in analysis time achieved through the imple­
mentation of carefully crafted playbooks developed for this project. These results have
paved the way for a more streamlined and efficient analysis workflow. Conversely, the re­
sults obtained from other playbooks demonstrate limited or even increased analysis times,
underscoring the criticality of thoughtful playbook design and development in harnessing
the full potential of SOAR. By automating repetitive tasks and streamlining certain aspects
of the analysis process, SOAR empowers SOC analysts to focus on more complex and
critical security incidents.
In future work, it is important to collect larger and more diverse datasets to evaluate the
usefulness of SOAR. Multiple SOC environments should be considered to assess gener­
alizability. Additionally, the output quality of SOAR needs to be evaluated, to ensure that
automated actions and decisions made by the system are accurate and reliable. Lastly,
a long­term evaluation of SOAR implementation and its impact on SOC efficiency and
quality of analysis should be conducted to understand scalability and adaptability.
22
Automation of SOC analysis using SOAR
==PAGE:28==
Bibliography
[1]
Internet Crime Complaint Center. Internet Crime Report. Federal Buerau of Investi­
gation, 2022. URL: https://www.ic3.gov/Media/PDF/AnnualReport/2022_IC3Report.
pdf.
[2]
Arctic Wolf. How Much Does It Cost to Build a Security Operations Center (SOC)?
https://arcticwolf.com/resources/blog/how-much-does-it-cost-to-build-a-soc/. [Online;
accessed 10­June­2023]. 2023.
[3]
Ross Brewer. “Could SOAR save skills­short SOCs?” In: Computer Fraud & Security
2019.10 (2019), pp. 8–11.
[4]
Charles P. Pfleeger, Shari Lawrence Pfleeger, and Jonathan Margulies. Security in
Computing. 5th. Prentice Hall, 2015. ISBN: 9780134085043.
[5]
Spencer Young. “Automated systems only: why CISOs should switch off their dumb
machines”. In: Network Security 2019.9 (2019), pp. 6–8.
[6]
Savannah Norem et al. “A mathematical framework for evaluation of SOAR tools with
limited survey data”. In: European Symposium on Research in Computer Security.
Springer. 2021, pp. 557–575.
[7]
Akalanka Perera et al. “The next gen security operation center”. In: 2021 6th Inter­
national Conference for Convergence in Technology (I2CT). IEEE. 2021, pp. 1–9.
Automation of SOC analysis using SOAR
23
==PAGE:29==
Technical
University of
Denmark
Richard Petersens Plads, Building 324
2800 Kgs. Lyngby
Tlf. 4525 1700
www.compute.dtu.dk
